checkMesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
wallShearStress1
	{
	type		wallShearStress;
           libs        ("libfieldFunctionObjects.so");
	patches		(bottomWall);
	writePrecision	8;
	writeToFile	true;
	executeControl	timeStep;
	writeControl	timeStep;
	writeInterval	1000;
	writeFields	true;
	}

averageWallShearStress
	{
	type		surfaceFieldValue;
	libs		("libfieldFunctionObjects.so");
	fields		(wallShearStress);
	operation		areaAverage;
	regionType		patch;
	surfaceFormat   	none;
	name		bottomWall;
	writePrecision	8;
	writeToFile	true;
	executeControl	timeStep;
	executeInterval 	1;

	writeControl	timeStep;
	writeInterval	1000;
	writeFields	true;
	}

}


// ************************************************************************* //
