checkMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topWall
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          400;
        startFace       319200;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       319600;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       320000;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       320400;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          320000;
        startFace       320800;
    }
)

// ************************************************************************* //
